<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"></ul></div>

In [2]:
import pandas as pd
from matplotlib import pyplot as plt

In [3]:
# Load the data (will take a short while)
calendar = pd.read_csv("airbnb_data/calendar.csv")
demographics = pd.read_csv("airbnb_data/demographics.csv")
econ_state = pd.read_csv("airbnb_data/econ_state.csv")
listings = pd.read_csv("airbnb_data/listings.csv")
real_estate = pd.read_csv("airbnb_data/real_estate.csv")
venues = pd.read_csv("airbnb_data/venues.csv")

In [4]:
dataset_names = ["calendar", "demographics", "econ_state", "listings", "real_estate", "venues"]
datasets = [calendar, demographics, econ_state, listings, real_estate, venues]

In [5]:
for i in range(len(datasets)):
    print(dataset_names[i])
    print(datasets[i].keys())
    print()

calendar
Index(['listing_id', 'date', 'available', 'price', 'metro_area'], dtype='object')

demographics
Index(['zipcode', '5_years_or_less', '5-9_years', '10-14_years', '15-19_years',
       '20-24_years', '25-34_years', '35-44_years', '45-54_years',
       '55-59_years', '60-64_years', '65-74_years', '75-84_years',
       '85_years_or_more', 'households', '$9,999_or_less', '$10,000-$14,999',
       '$15,000-$24,999', '$25,000-$34,999', '$35,000-$49,999',
       '$50,000-$64,999', '$65,000-$74,999', '$75,000-$99,999',
       '$100,000_or_more', 'median_household_income', 'mean_household_income'],
      dtype='object')

econ_state
Index(['state', '2005Q1_gdp', '2005Q2_gdp', '2005Q3_gdp', '2005Q4_gdp',
       '2006Q1_gdp', '2006Q2_gdp', '2006Q3_gdp', '2006Q4_gdp', '2007Q1_gdp',
       ...
       '2016/03_ur', '2016/04_ur', '2016/05_ur', '2016/06_ur', '2016/07_ur',
       '2016/08_ur', '2016/09_ur', '2016/10_ur', '2016/11_ur', '2016/12_ur'],
      dtype='object', length=519)

listings
Index(['accommodates', 'amenities', 'availability_30', 'bathrooms', 'bed_type',
       'bedrooms', 'beds', 'cancellation_policy', 'city', 'has_availability',
       'host_id', 'id', 'instant_bookable', 'latitude', 'longitude',
       'metropolitan', 'name', 'price', 'property_type',
       'review_scores_checkin', 'review_scores_cleanliness',
       'review_scores_communication', 'review_scores_location',
       'review_scores_rating', 'review_scores_value', 'room_type', 'state',
       'weekly_price', 'zipcode'],
      dtype='object')

real_estate
Index(['type', 'zipcode', 'city', 'state', 'metro', 'county', 'size_rank',
       '1996-04', '1996-05', '1996-06',
       ...
       '2016-09', '2016-10', '2016-11', '2016-12', '2017-01', '2017-02',
       '2017-03', '2017-04', '2017-05', '2017-06'],
      dtype='object', length=262)

venues
Index(['city', 'id', 'latitude', 'longitude', 'name', 'rating', 'types'], dtype='object')

In [10]:
calendar.head()

   listing_id        date available  price metro_area
0        2515  2018-03-05         t   69.0        NYC
1        2515  2018-03-04         t   69.0        NYC
2        2515  2018-03-03         t   69.0        NYC
3        2515  2018-03-02         t   69.0        NYC
4        2515  2018-03-01         t   69.0        NYC

In [12]:
calendar.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21841235 entries, 0 to 21841234
Data columns (total 5 columns):
listing_id    int64
date          object
available     object
price         float64
metro_area    object
dtypes: float64(1), int64(1), object(3)
memory usage: 833.2+ MB

In [15]:
calendar.metro_area.value_counts()

NYC        14874845
dc          2842620
chicago     1900555
boston      1308890
denver       914325
Name: metro_area, dtype: int64

In [22]:
calendar.loc[calendar["metro_area"]=='dc'].listing_id.value_counts()

8646530     365
416371      365
11721962    365
15019540    365
15357947    365
           ...
14715206    365
16427522    365
454026      365
1542055     365
835992      365
Name: listing_id, Length: 7788, dtype: int64

In [21]:
calendar.loc[calendar["metro_area"]=='NYC'].listing_id.value_counts()

253828      365
11697378    365
5750871     365
2273019     365
10723037    365
           ...
10551675    365
6233785     365
17249724    365
6658537     365
10433510    365
Name: listing_id, Length: 40753, dtype: int64

In [23]:
calendar.loc[calendar["metro_area"]=='chicago'].listing_id.value_counts()

15410843    365
11607924    365
10837496    365
16401947    365
15618206    365
           ...
17480697    365
5551160     365
12211684    365
8548067     365
16814098    365
Name: listing_id, Length: 5207, dtype: int64

In [24]:
calendar.loc[calendar["metro_area"]=='boston'].listing_id.value_counts()

12898806    730
14710769    365
7018497     365
3946215     365
951473      365
           ...
13951039    365
13512551    365
5270703     365
901914      365
3250739     365
Name: listing_id, Length: 3585, dtype: int64

In [25]:
calendar.loc[calendar["metro_area"]=='denver'].listing_id.value_counts()

6865639     365
6578731     365
9944159     365
4545539     365
7243639     365
           ...
5650314     365
10683692    365
10308837    365
5604348     365
1422518     365
Name: listing_id, Length: 2505, dtype: int64

In [37]:
calendar.groupby(["metro_area", "listing_id"]).count()

                       date  available  price
metro_area listing_id
NYC        2515         365        365    306
           2595         365        365    365
           3647         365        365    365
           3831         365        365    147
           4611         365        365    239
...                     ...        ...    ...
denver     13046861     365        365     21
           13058575     365        365    362
           13059132     365        365    342
           13059481     365        365    359
           13059899     365        365    255

[59838 rows x 3 columns]

In [39]:
listings_by_area_date = calendar.drop(["available","price"],axis=1)

In [44]:
print(listings_by_area_date)

          listing_id        date metro_area
0               2515  2018-03-05        NYC
1               2515  2018-03-04        NYC
2               2515  2018-03-03        NYC
3               2515  2018-03-02        NYC
4               2515  2018-03-01        NYC
...              ...         ...        ...
21841230    18364166  2017-05-14         dc
21841231    18364166  2017-05-13         dc
21841232    18364166  2017-05-12         dc
21841233    18364166  2017-05-11         dc
21841234    18364166  2017-05-10         dc

[21841235 rows x 3 columns]

In [46]:
calendar_nyc = calendar.loc[calendar.metro_area == "NYC"]

In [49]:
import datetime

In [67]:
from datetime import datetime
calendar_nyc.loc[:,'date_year'] = calendar_nyc.loc[:,"date"].apply(lambda x: x[:4])

In [68]:
calendar_nyc.date_year

0           2018
1           2018
2           2018
3           2018
4           2018
            ...
14874840    2017
14874841    2017
14874842    2017
14874843    2017
14874844    2017
Name: date_year, Length: 14874845, dtype: object

In [70]:
calendar_nyc.groupby(['date_year']).describe()

          listing_id                                                  \
               count          mean           std     min         25%
date_year
2017       9883345.0  9.912284e+06  5.582245e+06  2515.0  4995083.00
2018       4991500.0  9.911484e+06  5.582070e+06  2515.0  4994661.25

                                                   price              \
                  50%         75%         max      count        mean
date_year
2017       10019335.0  14968000.0  18519989.0  3577908.0  166.776264
2018       10018550.0  14967904.0  18519989.0  1886320.0  164.252165


                  std   min   25%    50%    75%      max
date_year
2017       268.012091  10.0  70.0  110.0  192.0  20000.0
2018       254.929938  10.0  73.0  115.0  190.0  20000.0

In [72]:
calendar_nyc.loc[:,'date_month'] = calendar_nyc.loc[:,"date"].apply(lambda x: x[5:7])

In [73]:
set(calendar_nyc.date_month.values)

{'01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12'}

In [90]:
months = ['12','01','02','03','04','05','06','07','08','09','10','11']
seasons = ["Winter","Winter","Winter","Spring","Spring","Spring","Summer","Summer","Summer","Fall","Fall","Fall"]
seasons_dict = dict(list(zip(months,seasons)))

In [107]:
#calendar_nyc.loc[:,"season"] = calendar_nyc.loc[:,"date_month"]
calendar_nyc["season"] = list(calendar_nyc["season"].map(seasons_dict))

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [108]:
calendar_nyc.season

0           Spring
1           Spring
2           Spring
3           Spring
4           Spring
             ...
14874840    Spring
14874841    Spring
14874842    Spring
14874843    Spring
14874844    Spring
Name: season, Length: 14874845, dtype: object

In [109]:
calendar_nyc.groupby(['date_year','season']).describe()

                 listing_id                                                 \
                      count          mean           std     min        25%
date_year season
2017      Fall    3708523.0  9.912016e+06  5.582187e+06  2515.0  4995083.0
          Spring  1162203.0  9.914300e+06  5.582687e+06  2515.0  4996877.0
          Summer  3749276.0  9.912016e+06  5.582187e+06  2515.0  4995083.0
          Winter  1263343.0  9.912016e+06  5.582188e+06  2515.0  4995083.0
2018      Spring  2587073.0  9.910989e+06  5.581963e+06  2515.0  4994462.0
          Winter  2404427.0  9.912016e+06  5.582187e+06  2515.0  4995083.0

                                                          price              \
                         50%         75%         max      count        mean
date_year season
2017      Fall    10019312.0  14967994.0  18519989.0  1397812.0  167.408171
          Spring  10020815.0  14968955.0  18519989.0   281176.0  166.104682
          Summer  10019312.0  14967994.0  18519989.0  1460803.0  164.270674
          Winter  10019312.0  14967994.0  18519989.0   438117.0  173.545503
2018      Spring  10018549.0  14967881.0  18519989.0   987872.0  164.640939
          Winter  10019312.0  14967994.0  18519989.0   898448.0  163.824694


                         std   min   25%    50%    75%      max
date_year season
2017      Fall    260.853991  10.0  72.0  110.0  194.0  20000.0
          Spring  308.369919  10.0  69.0  100.0  185.0  20000.0
          Summer  264.431691  10.0  70.0  110.0  190.0  20000.0
          Winter  274.350850  10.0  75.0  115.0  199.0  20000.0
2018      Spring  254.663218  10.0  74.0  115.0  190.0  20000.0
          Winter  255.222342  10.0  73.0  113.0  189.0  20000.0

In [112]:
calendar_nyc.groupby(['date_year','season','available']).count()

                            listing_id     date    price  metro_area  \
date_year season available
2017      Fall   f             2310711  2310711        0     2310711
                 t             1397812  1397812  1397812     1397812
          Spring f              881027   881027        0      881027
                 t              281176   281176   281176      281176
          Summer f             2288473  2288473        0     2288473
                 t             1460803  1460803  1460803     1460803
          Winter f              825226   825226        0      825226
                 t              438117   438117   438117      438117
2018      Spring f             1599201  1599201        0     1599201
                 t              987872   987872   987872      987872
          Winter f             1505979  1505979        0     1505979
                 t              898448   898448   898448      898448

                            date_month
date_year season available
2017      Fall   f             2310711
                 t             1397812
          Spring f              881027
                 t              281176
          Summer f             2288473
                 t             1460803
          Winter f              825226
                 t              438117
2018      Spring f             1599201
                 t              987872
          Winter f             1505979
                 t              898448

In [113]:
calendar_nyc.to_csv('calendar_nyc.csv',index=False)